notes/notes.tex
% Created 2017-07-25 Tue 15:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{natbib}
\date{\today}
\title{Thesis notes}
\hypersetup{
 pdfauthor={},
 pdftitle={Thesis notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.0.94.2 (Org mode 9.0.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Framing}
\label{sec:org1e71ba7}
How the project could be framed
\subsection{As a creative tool}
\label{sec:org592e895}
\subsubsection{For composers}
\label{sec:org34fa9a3}
\subsubsection{For novices}
\label{sec:orgf238ae3}
\subsubsection{For music producers (edm, etc)}
\label{sec:org34b6665}
\subsection{As an interactive composition}
\label{sec:orgb6b2ca6}
Reference appraisal of Golan Levin
\subsection{As a composition}
\label{sec:org1021683}

\section{Software programs}
\label{sec:org66b2781}
\subsection{OpenMusic\hfill{}\textsc{notation:algorithmic:ircam}}
\label{sec:orgd65eb2c}
\subsection{Midishare\hfill{}\textsc{notation:algorithmic:orlarey:grame}}
\label{sec:org0d4ba51}
\subsection{Faust\hfill{}\textsc{grame}}
\label{sec:orgea41ad6}

\section{Refs}
\label{sec:org9e9fa25}
\subsection{Developing a flexible and expressive realtime polyphonic wave terrain synthesis instrument based on a visual and multidimensional methodology}
\label{sec:orgf68873e}
This is a thing about things and stuff! \citeyear{james_developing_2005}

\subsection{Imagining the Tenth Dimension - 2012 Version}
\label{sec:orgcf88550}
\cite{10thdim_imagining_2012}

This is a thing

\subsection{Music navigation with symbols and layers: toward content browsing with \{IEEE\} 1599 \{XML\} encoding}
\label{sec:org3c36ba8}
\cite{baggi_music_2013}


\subsection{2013 - Grammar-based automated music composition in Haskell}
\label{sec:org1e7619f}

\subsection{2014 - Real-time \{Music\} \{Composition\} through \{P\}-timed \{Petri\} \{Nets\}.}
\label{sec:orgac2d8e7}
\cite{barate_real-time_2014}

\#+BEGIN\(_{\text{QUOTE}}\)
As regards future works, since Petri nets are a formalism
usually far from the way of thinking of a traditional composer,
software tools should be designed and developed to
implement a musician-oriented interface. 
\#+END


\subsection{1971 - Norman \{McLaren\} : \{Synchromy\}}
\label{sec:org5830a4f}
\cite{anathemecollection_norman_1971}

Nice video
\section{Books}
\label{sec:org60e7124}
\subsection{XV. Liszt's Faust Symphony: A Semantic Analysis}
\label{sec:org474eb0a}
\cite{il_xv}
\subsubsection{Approach to things}
\label{sec:org35c47cc}
Yes it is




\cite{quick13_gramm_haskel}



\subsection{{\bfseries\sffamily TODO} 2011 - Brave \{\{NUI\}\} World: Designing Natural User Interfaces for Touch and Gesture}
\label{sec:org4642a6f}
\cite{wigdor_brave_2011}

This book has some excellent ideas contained within it!!!

\begin{quote}
Hello world how is that you are such a great world!
\end{quote}

\section{Website articles}
\label{sec:org7a59c6c}
\subsection{Interview by Aphex Twin with Korg engineer\hfill{}\textsc{musician:synth\_design:tuning}}
\label{sec:org39b8e68}
\cite{_aphex_2017}

\begin{quote}
Yes, many. For instance, on the Chroma I like holding down one key, pressing
another key and ththing:yo:en tuning the second key in relation to the first,
sometimes making two extremely different frequency combinations, like something
very low and extremely high at the same time and maybe a group of these dual
combos only existing in the top octave of the keyboard map, the rest being
another tuning or multiple tunings, all in one tuning table.

It's something I never saw in anyone else's tunings, combining several
tuning tables within one map, so that's one of my little inventions I guess, as
I rarely used the full range of 127 notes in one tuning within one track.
monologue can tune four notes at a time which we planned. It's a different
approach again and something I look forward to experimenting with more.
\end{quote}

\section{People}
\label{sec:org4a52a54}
\subsection{Orlarey\hfill{}\textsc{grame:faust:functional:midishare}}
\label{sec:org8ff8db8}
\subsection{Schmidt, Karsten :clojure:th.ing:generative:}
\label{sec:org3793485}

\section{Institutions}
\label{sec:orgea1202e}
\subsection{Grame}
\label{sec:org144167f}

\subsection{{\bfseries\sffamily TODO} 2009 - The \{\{Musical Interface Technology Design Space\}\}}
\label{sec:orga89d64a}
\cite{overholt_musical_2009}

This is a thing!!!



\subsection{{\bfseries\sffamily TODO} 2013 - Designing the \{\{Drum Loop\}\} - \{\{A\}\} Constructivist \{\{iOS\}\} Rhythm Tutorial System for Beginner (\{\{Thesis\}\})}
\label{sec:orgd1efd46}
\cite{hein_designing_2013}

\bibliographystyle{unsrt} 
\bibliography{../bibliography/mmt-thesis}
\end{document}